---

C#Visual BasicVisual C++

Revit 2024 API
---
SolidCurveIntersection..::..GetEnumerator Method
SolidCurveIntersection Class See Also Send Feedback
---

Returns an enumerator that iterates through a collection.

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)

# Syntax

C#
---

    public virtual IEnumerator<Curve> GetEnumerator()

Visual Basic
---

    Public Overridable Function GetEnumerator As IEnumerator(Of Curve)

Visual C++
---

    public:
    virtual IEnumerator<Curve^>^ GetEnumerator()

#### Return Value

An IEnumerator object that can be used to iterate through the collection.

#### Implements

IEnumerable<(Of <(<'T>)>)>..::..GetEnumerator()()()()

# See Also

SolidCurveIntersection Class

Autodesk.Revit.DB Namespace